cases/chpt4-aluminum-Marg-dsdT-neg/system/blockMeshDict
  /*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices 
(
    (0 -0.1 0)
    (20 -0.1 0)
    (20 0.1 0)
    (0 0.1 0)
    (0 -0.1 20)
    (20 -0.1 20)
    (20 0.1 20)
    (0 0.1 20)

);

blocks
(
//    hex (0 1 2 3 4 5 6 7) allZone (8 1 6) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) allZone (50 1 50) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    hot
    {
        type patch;
        faces
        (
        (0 4 7 3)        
        );
    }
    cold
    {
        type wall;
        faces
        (
        (2 6 5 1)
        );
    }
    top
    {
        type wall;
        faces
        (
        (4 5 6 7)
        );
    }
    btm
    {
        type wall;
        faces
        (
        (0 3 2 1)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
        (3 7 6 2)
        (1 5 4 0)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
