cases/chpt4-aluminum-Marg-dsdT-neg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    hot
    {
        type            patch;
        nFaces          50;
        startFace       4900;
    }
    cold
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       4950;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       5000;
    }
    btm
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       5050;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          5000;
        startFace       5100;
    }
)

// ************************************************************************* //
