cases/chpt4-aluminum-Marg-dsdT-neg/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    cold
    {
        type            fixedFluxPressure;
        value           $internalField;
//        type            zeroGradient;
    }
    btm
    {
        type            fixedFluxPressure;
        value           $internalField;
//        type            zeroGradient;
    }
    top    
    {
        type            fixedFluxPressure;
        value           $internalField;
//        type            totalPressure;
//        p0              $internalField;
    }
    hot
    {
        type            fixedFluxPressure;
        value           $internalField;
//        type            zeroGradient;
    }
    frontAndBack
    {
        type empty;
    }
}


// ************************************************************************* //
