cases/chpt4-aluminum-Marg-dsdT-neg/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 983.5; 

boundaryField
{
    hot
    {
        type   fixedValue;
//        value uniform 988.5;
        value uniform 1033.5;
    } 
    top
    {
      type   zeroGradient; // adiabatic
      value           $internalField;
    }
    btm
    {
      type   zeroGradient; // adiabatic
      value           $internalField;
    }
    cold
    {
        type          fixedValue;
//        value         uniform 978.5;
        value         uniform 933.5;
    }
    frontAndBack
    {
        type empty;
    }
}           

// ************************************************************************* //
